Revit.Elements.Views.Sheet.InitSheet(System.String,System.String,Autodesk.Revit.DB.FamilySymbol)
Initialize a Sheet element with a name, number and specific titleblock.
sheetName: name of the sheet.
sheetNumber: sheet number.
titleBlockFamilySymbol: sheet titleblock.

Revit.Elements.Views.Sheet.ByNameNumberTitleBlockAndViews(System.String,System.String,Revit.Elements.FamilyType,Revit.Elements.Views.View[])
Create a Revit Sheet.
This method will automatically pack the views onto the sheet.
sheetName: Sheet Name as String.
sheetNumber: Sheet Number as String.
titleBlockFamilyType: Titleblock that will be assigned to created Sheet.
views: Views to be placed on Sheet.
Returns:

Revit.Elements.Views.Sheet.ByNameNumberTitleBlockAndView(System.String,System.String,Revit.Elements.FamilyType,Revit.Elements.Views.View)
Create a Revit Sheet.
This method will automatically pack the view onto the sheet.
sheetName: Sheet Name as String.
sheetNumber: Sheet Number as String.
titleBlockFamilyType: Titleblock that will be assigned to created Sheet.
view: Views to be placed on Sheet.
Returns:

Revit.Elements.Views.Sheet.ByNameNumberTitleBlock(System.String,System.String,Revit.Elements.FamilyType)
Create a Revit Sheet by the sheet name, number and a title block FamilyType.
sheetName: Sheet Name as String.
sheetNumber: Sheet Number as String.
titleBlockFamilyType: Titleblock that will be assigned to created Sheet.
Returns: The new empty Revit sheet.